"""
sum = 0
while True:
    a = int(input("Enter first number\t"))
    b = int(input("Enter second number\t"))
    c = a+b
    if a == 0 or  c > 100:
        print(c)
        sum +=c
        break
"""
import random

"""
Напишіть програму яка буде запитувати вік користувача поки він не введе допустимий вік між (0-120) Якщо введений вік знаходиться в допустимому діапазоні програма завершується 

program_ask = int(input("Enter your age\t"))
n =0
while program_ask <= 120:
    if program_ask >= 0:
        print(program_ask)
        break
    elif program_ask > 120:
        print("Error")
    else:
         print("Error")
        break
"""

"""  Програма яка буде обчислювати суму цілих чисел від (а до 500) значення (а) 
  вводиться з клавіатури 

a = int(input("Enter number\t"))
for i in range(a,500):
    print(f"{a}+{i}=",a+i)

Програма яка запитуе два цілих числа (x) та (y), після чого обчислює та виводить значення (х) у степені (у)

x = int(input("Enter number\t"))

y = int(input("Enter number\t"))
while x**y:
 print(x**y)
 break
"""

"""Знайти серенє арифметичне всіх цілих чисел від (1 до 1000)"""





""" Знайти здобуток всіх цілих чисел  від (а до 20) а вводиться з клавіатури (1<=a<=20)

a = int(input("Enter number\t"))
for i in range(a,21):
 if 1<=a<=20:
  print(f"{a}+{i}=",a + i)
"""
"""
### Напишіть програму  яка буде обчислювати суму введених користувачем чисел.
# Програма повинна зупинитись якщо сума перевищить 100 або користувач введе 0 ###\
"""

"""
Напишіть програму яка буде запитувати вік користувача поки
він не введе допустимий вік між (0-120) Якщо введений вік знаходиться в допустимому діапазоні
програма завершується """

"""Програма яка приймає числа від користувача і зупиняється при введенні числа кратного (7)"""

""" Знайти здобуток всіх цілих чисел  від (а до 20) а вводиться з клавіатури (1<=a<=20)

"""
"""1)Перевірка на паліндром:
Написати програму, яка буде перевіряти чи є слово(рядок) , яке вводить користувач є паліндромомНаписати програму, яка буде перевіряти чи є слово(рядок) , яке вводить користувач є паліндромом
(тобто читається однаково із обох боків) rokkor


a = input("Введіть слово \t")
b = a[::-1]
if b == a:
    print("Паліндром")
else:
    print("Не паліндром")
"""
"""2)Написати програму , де користувач вводить рядок, 
потім вводить символ який він хоче замінити та вводить новий символ , програма має вивести оновлений рядок
"""
"""
a = input("Enter your element\t")
my_list = ["hello1" , "hello" , "hello3","-3","60","0"]
for index,elem in enumerate(my_list ):
    if a == elem:
        print(index)
"""
my_list = ["hello1" , "hello" , "hello3",-3,60,0]
for index in range(len(my_list)):
    if my_list[index] == "hello":
        print(f"{elem}, {index})












































